using Task3;

enum ТипЗаказчика
{
    Корпоративный,
    Частный
}

class Заказчик
{
    public string ФИО { get; set; }
    public string Адрес { get; set; }
    public double ПотраченнаяСумма { get; set; }
    public ТипЗаказчика Тип { get; set; }

    public Заказчик(string ФИО, string Адрес, double ПотраченнаяСумма)
    {
        this.ФИО = ФИО;
        this.Адрес = Адрес;
        this.ПотраченнаяСумма = ПотраченнаяСумма;
        this.Тип = ТипЗаказчика.Корпоративный;
    }

    public void ВывестиИнформацию()
    {
        Console.WriteLine($"ФИО: {ФИО}");
        Console.WriteLine($"Адрес: {Адрес}");
        Console.WriteLine($"Потраченная сумма: {ПотраченнаяСумма}");
        Console.WriteLine($"Тип заказчика: {Тип}");
    }
}

class Program
{
    static void Main()
    {
        Заказчик[] заказчики = new Заказчик[3];
        заказчики[0] = new Заказчик("Голышев Илья", "Ул. Тургенева д.10", 5000);
        заказчики[1] = new Заказчик("Голышев Илья", "Ул. Тургенева д.10", 5000);
        заказчики[2] = new Заказчик("Голышев Илья", "Ул. Тургенева д.10", 5000);

        ТипЗаказчика типПоиска = ТипЗаказчика.Корпоративный;
    }
}